Revit 2026 API

# CurveIsInside(Double) Method

---

Indicates whether the specified parameter value is within this curve's bounds.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsInside(
	double parameter
)
```
```vb
Public Function IsInside (
	parameter As Double
) As Boolean
```
```cpp
public:
bool IsInside(
	double parameter
)
```
```fsharp
member IsInside :
        parameter : float -> bool
```

#### Parameters

parameter Double
    The raw curve parameter to be evaluated.

#### Return Value

BooleanTrue if the parameter is within the bounds, otherwise false.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified parameter is infinite. |

Always returns true if this curve is unbound.

#### Reference

Curve Class

IsInside Overload

Autodesk.Revit.DB Namespace